{
    "paper_id": "The Journal of Pathology - 2007 - Liu - Ageing and hearing loss",
    "title": "Ageing and hearing loss",
    "abstract": "Although many adults retain good hearing as they age, hearing loss associated with ageing is common among elderly persons. There are a number of pathophysiolological processes underlying age-related changes to functional components in the inner ear. Genetic factors determine the ageing process but are under the influence of intrinsic and environmental factors. It is difficult to distinguish changes of normal ageing from those of other contributing factors. The effects of age-related deafness can have significant physical, functional and mental health consequences. Although a deficit in hearing can be corrected to some degree by a hearing aid or other appropriate amplification devices, hearing-related rehabilitative needs are much more than simply amplifying external sound. Only by better understanding the process of ageing and its effect on the auditory function can we better accommodate elderly people in our day-today interactions. We review here the structure and function of the inner ear, pathophysiology associated with age-related hearing loss (ARHL), heritability, allelism and modifier genes of ARHL, and evaluate the genetic analyses for identification of genetic factors that are involved.",
    "question_answer_pairs": [],
    "body_text": [
        {
            "section": "Introduction",
            "text": "Presbycusis, or age-related hearing loss (ARHL), is polygenic/multifactorial in aetiology [1] . ARHL is thought to result from age-related degeneration of the cochlea with the cumulative effects of extrinsic damage (noise and other ototoxic agents) and intrinsic disorders (e.g. systemic diseases). The gradual presbycusic loss of hearing sensitivity is associated with difficulty in speech discrimination. Presbycusis sufferers first have a high tone hearing loss (HL), which has a major adverse effect on communication, particularly in noisy and/or reverberant listening situations. Once the loss progresses to the 2-4 kHz range, thresholds for word, consonant and even vowel identification are increased [2] . Thus, by itself, a loss of hearing lowers the quality of life, and for most hearing-impaired people the HL has psychological, physical and social consequences. Hearing and understanding of speech presented in situations where there is interference, such as a noisy room, deteriorate later in life. Over the past several decades, a considerable amount of research and theoretical speculation has accumulated on age-related changes in speech perception. Can the presbycusic threshold shifts account fully for the speech understanding problem in elderly individuals? While loss in peripheral hearing sensitivity explains many of the listening problems of elderly persons, some studies suggest that age-related declines in general cognitive skill and central auditory processing also appear to contribute. The relative contribution of cognitive factors to speech-understanding difficulties remains controversial. It is also unresolved whether presbyscusis is a central or a peripheral phenomenon. Finally, although there is a general consensus that the cochlea is the site of ARHL, there is still the very difficult and incompletely resolved issue as to which sites in the cochlea are affected by age, and the site of the most functional significance is an area of much controversy."
        },
        {
            "section": "Epidemiology",
            "text": "HL is a major public health problem [3] . More than 28 million individuals in the USA have HL and this number is expected to raise with the rapidly increasing number of elderly people, with projections that there will be nearly 60 million Americans (19% of the total population) aged 65 and older by the year 2025 [4] . Presbycusis is one of the four leading chronic health conditions experienced by the the elderly [5, 6] . The prevalence of HL accelerates dramatically with age, with approximately 25% of subjects aged 50-65 years having hearing thresholds greater than 30 dB in at least one ear [7, 8] , and self-reported HL can be identified in half of those aged 85 years and older [9] ."
        },
        {
            "section": "Epidemiology",
            "text": "In a longitudinal study of patients from the Framingham cohort [10] , consisting of 1475 patients over a 6 year period, the rate of hearing decline observed has been found to be consistent with two patterns of hearing degeneration, corresponding to an average 6 year threshold change in the range 1-8 dB at 250-256 kHz and 10-15 dB at 8 kHz. The lowfrequency (250-251 kHz) pattern of HL appeared to be age-dependent, and women had worse thresholds than men. On the other hand, for the high-frequency (4-8 kHz) pattern of HL, the rate of threshold change was found to decrease with age and with the initial threshold at rates that did not differ between genders. In addition, auditory thresholds in the two ears are seldom equal. The left ear often has the higher threshold, and its relative disadvantage increases with age. The low-frequency pattern change of hearing is interpreted as possibly representing a disorder of the stria vascularis (the cochlear tissue that generates the endocochlear potential), which is largely responsible for generating electrochemical gradients and regulating ion homeostasis in the cochlea, whereas the high-frequency pattern of hearing loss is likely associated with a hair cell disorder [10, 11] . Another study, the Baltimore Longitudinal Study of Aging, examined 681 men and 416 women during 1965-1995, using standard pure-tone audiometry [12] . A conclusion of this study differs somewhat from the interpretation of the Framingham data, which suggested that the preponderance of male high-frequency HL is related to occupational noise exposure. Epidemiological studies have consistently shown a 30-70% incidence of ARHL but widely variable assessments of the degree of impairment induced by the hearing loss."
        },
        {
            "section": "Auditory structure and function",
            "text": "Whereas age-related structural changes of the external and middle ear do not appear to have an adverse effect on audiometric function or speech understanding ability, the cochlea is dramatically affected by the ageing process. The cochlea (Latin for 'snail shell') and the semicircular canals, with the associated utricle and saccule, constitute the inner ear. The cochlea, a coiled structure enclosing three fluid-filled ducts or scalae (Figure 1 ), is encased in the temporal bone. These ducts are functionally divided into two spaces. The scala tympani and scala vestibuli communicate with each other via the helicotrema and are filled with perilymph. The scala media is isolated from the perilymphatic space and contains endolymph. The latter fluid, bathing the upper surface of the hair cell, contains an electrolyte composition similar to that found in intracellular fluids, that is, high in potassium Figure 1 . A schematic representation of the cochlear duct, showing the proposed medial and lateral K + ion recycling routes from inner and outer hair cells during auditory transduction. In the medial path (left), K + released from inner hair cells (IH) diffuse medially through the interdental cells to the undersurface of the tectorial membrane (TM) and the scala media. K + pumped from the scala vestibuli into supralimbal cells floods into light fibrocytes and is transported into the endolymph by Na-K-ATPase pumps present in interdental cells. In the lateral path (right), K + ions from outer hair cells (OH) are resorbed by Deiters'cells (D) and tectal cells (T) and move via a network of the gap junction system to the type 1a, 1b, II, IV and V fibrocytes in the spiral ligament, for return to the scala media via the stria vascularis (SV) Figure reproduced by courtesy of J DeLeon 190 XZ Liu et al (K + ) and low in sodium (Na + ) and calcium (Ca ++ ), and is maintained at a high positive resting potential of around +80-100 mV, which is essential for normal hair cell function."
        },
        {
            "section": "Auditory structure and function",
            "text": "The organ of Corti, including the sensory hair cells and supporting cells, rests on a relatively permeable basilar membrane, with the most external row of the outer hair cell stereocilia embedded in the gelatinous tectorial membrane. Below this is the scala tympani, high in Na + and low in K + , similar in composition to extracellular fluid. In the spiral ligament and stria vascularis reside the enzyme systems and cellular organelles necessary for the differences in electrolyte content between the perilymph and endolymph in the cochlear ducts. Pumping of K + into the endolymph occurs against a concentration gradient and thus requires energy expenditure. Enzymes, specifically Na + /K + ATPase, use metabolic energy stores (ATP) generated by the mitochondria of the stria and spiral ligament to pump Na + and K + ions against their concentration gradients. These enzymes are located within the marginal cells of the stria and the fibrocytes of the spiral ligament. They serve to transport K + through the spiral ligament and stria vascularis, and they secrete it into the endolymph. Their function is assisted by a Na + /Cl − /K + cotransporter located in the marginal cells. Several possible routes for K + recycling have been proposed, including a lateral recycling pathway, whereby K + is reabsorbed through a K/Cl co-transporter in the supporting cells (Tectal and Dieter's cells) of the organ of Corti. K + may then move down its electrochemical gradient, passing between cells through gap junctions until reaching Type I spiral ligament fibrocytes (SLFs) and back to the stria vascularis [13] , and also recycling routes through the perilymph to the spiral ligament, either above or below the endolymph compartment, and hence to the stria [14] . Another route is a medial recycling pathway through which excess K + is returned to the scala media through medial supporting cells, spiral limbus fibrocytes and interdental cells, all coupled by gap junctions, with transport into endolymph by Na-K-ATPase pumps present in the interdental cells [13] [14] [15] . Therefore, the endolymph and perilymph electrolyte contents are regulated by local radial flow of electrolytes and not longitudinal flow of fluids along the length of the cochlea."
        },
        {
            "section": "Auditory structure and function",
            "text": "Pressure waves from sound travelling up the scala vestibuli and back down the scala tympani produce a shearing force on the hair cells of the organ of Corti. The apical surface of the hair cell has a relatively high inertial resistance to movement, so that sound-induced shearing forces bend the stereocilia. This bending produces mechanical opening of ionic channels [16] , depolarizing hair cells due to K + influx. Conversely, stereocilia bending in the opposite direction create a hyperpolarization by closing those channels that are constantly open, even in the resting state, thus further obstructing K + flow down the electrochemical gradient. Within the cochlea, hair cell sensitivity to frequencies progresses in a tonotopic pattern from high frequencies at the base to low frequencies at the apex. The cells in the single row of inner hair cells passively respond to deflections of sound-induced pressure waves. Cells in the rows of outer hair cells can elongate or shorten in response to motion of the basilar membrane to actively produce amplification or attenuation of the response of the inner hair cells [17] . Efferent innervation by fibres from the olivary nucleus caudally and the dorsal nucleus of the trapezoid body rostrally also provide regulation of the sensitivity of the inner and outer hair cells [18] ."
        },
        {
            "section": "Pathophysiology associated with presbycusis",
            "text": "Presbycusis is a bilateral loss of auditory sensitivity that progresses from high to low frequencies with ageing. However, the rate of hearing decline is not linear and is highly variable, and the variance in hearing level is only weakly associated with age [11] . These observations suggest that age-related changes do not occur uniformly and that more than one pathological process may be acting upon the auditory system. This variety may also be taken as indirect evidence of the complex interaction of genetic and environmental factors in the aetiology of presbycusis. Adding to the complexity, both the peripheral and central auditory pathways can be affected in presbycusis."
        },
        {
            "section": "Pathophysiology associated with presbycusis",
            "text": "Early knowledge about the pathology of human presbycusis was based on the audiometric data archived in the laboratory of Schuknecht, on patients whose temporal bones later became available post mortem and on the histopathological technique available at the time [19] . According to Schuknecht 's scheme, degeneration of the organ of Corti, ganglion cell loss, strial atrophy and basilar membrane stiffness (a hypothetical subtype) can occur independently and give rise to distinct types of ARHL (sensory, neural, strial or metabolic, and cochlear conductive, respectively). Two more categories have subsequently been added: mixed and indeterminate. The latter has been reported to account for 25% of cases [20] and in most cases, a mixture of pathological changes have been noted [21] . Although there is a general consensus that the cochlea is the site of ARHL, otopathologic changes to the inner ear as a direct function of age remain controversial. Sensory presbyscusis categorizes patients with normal lowfrequency hearing but threshold sensibility loss in the highest frequencies. It is caused by a primary loss of hair cells in the basal end of the cochlea and typified by an audiometric pattern of a steeply sloping high-frequency loss resembling noise injury. There is ample evidence that noise constitutes a significant risk to hearing health and its additive effect in combination with age has been proposed. However, how noise-induced hearing loss (NIHL) and ARHL (which often coexist in the same ear) interact and the mechanisms by which they do so remain poorly understood. Addressing the ARHL-NIHL interaction in humans is difficult and the results of studies on hearing losses in noise-exposed and/or ageing ears are contradictory and highly variable [22] [23] [24] [25] . This variability may arise from underlying differences in actual noise exposure and because, in part, noise and ageing are both under the influence of other intrinsic and environmental variables that can, by themselves, lead to HL or alter NIHL and/or ARHL vulnerability."
        },
        {
            "section": "Pathophysiology associated with presbycusis",
            "text": "While the location of the site within the cochlea responsible for presbycusis is continually debated, recent studies lend support to degenerative changes in the lateral wall and stria vascularis as a major contributor to the HL associated with advancing age, a condition termed 'metabolic or strial presbycusis' [26] . Metabolic presbycusis was characterized clinically as showing a flat audiometric pattern [20] . An alteration of endolymph may explain the elevated pure tone thresholds across all frequencies of the auditory spectrum. Accompanying or directly resulting age-related changes in the stria vascularis are loss of expression of key ion transport enzymes, such as Na + , K + -ATPase and the Na + , K + , Cl − co-transporter, as well as a dramatic age-related decrease in endocochlear potential (EP) values. The EP is an 80-100 mV dc resting potential in the scala media ( Figure 1 ). Additionally, an increased threshold of the compound action potential (CAP) of the auditory nerves may be an indication of loss of auditory nerve function. The reduced amplitudes of action potentials have been interpreted as a possible decline in synchronized neural activity in the auditory nerve. However, it remains difficult to distinguish dysfunctions of the auditory nerve caused by a decreased EP from those resulting from degeneration of spiral ganglion neurons [27] . Agerelated asynchronous activity of the auditory nerve could account for age-related declines in temporal resolving abilities, which are sometimes interpreted as solely caused by age-related changes in the properties of the auditory central nervous system [25] . Strial presbycusis is generally considered to be an ageing effect independent of exogenous damage, whereas ageing and insults accumulated (most commonly noise exposure) over the course of a lifetime are believed to be the key factors implicated in sensory presbycusis. There is evidence to suggest that NIHL and ARHL, once thought to be distinct pathological entities, may in fact be overlapping phenotypes [25] . Most ageing human and animal cochleae show a mix of pathologies affecting different cell types. It is often impossible to correlate the pattern and extent of HL with particular lesions, or to attribute the lesions to specific genetic or environmental causes. Nevertheless, whether cells and structures of the cochlea are affected by environmental and genetic factors particular to each has implications for more general issues of how ARHL arises, and how it might be prevented."
        },
        {
            "section": "Non-genetic components of presbycusis",
            "text": "Several environmental and medical risk factors have been implicated as contributing to presbycusis. It is unclear whether these factors have an accelerating effect of ageing in the ear or whether they act on specific physiological pathways. There is a general consensus that ARHL is the result of various types of physiological degeneration plus the accumulated effects of environmental factors, medical disorders and their treatment, as well as interindividual differences in susceptibility genes. These variables do not lend themselves easily to retrospective quantification. Noise is the most-studied and best-documented environmental factor causing HL. The primary lesion from long-term noise exposure is loss of the outer hair cells, and later also loss of the inner hair cells if exposure continues [28] . Ultimately, after a lifetime of noise exposure, it is difficult to distinguish between NIHL and ARHL, audiometrically as well as anatomically. Additional environmental factors, such as ototoxic substances, drugs or even diet, can influence susceptibility to ARHL [29] [30] [31] . Aminoglycoside antibiotics can damage hair cells in the same pattern as noise, causing a non-reversible HL predominantly affecting high frequencies. In addition, aminoglycosides seem to enhance the ototoxic effect of noise and vice versa [29] . Furthermore, some studies have demonstrated that individual factors, such as smoking, elevated blood pressure and cholesterol levels, may influence the degree of ARHL [32] [33] [34] ."
        },
        {
            "section": "Heritability, allelism and genetic modifiers of presbycusis",
            "text": "Presbycusis does cluster in families [35] and heritability estimates indicate that 35-55% of the variance of ARHL is attributable to the effects of genes: A Swedish study consisting of 250 monozygotic and 307 dizygotic male twins (aged 36-80) showed a heritability of 47% for the population above 65, using both questionnaire and audiometric data [36] . Using the same analytical method, the National Academy of Science-National Research Council (NAS-NRC) ageing twin panel study in the USA has estimated the heritability at 61% [37] . Across all ages, environmental and hereditary factors were found to be important sources of variation, with environmental factors becoming more influential with increasing age. In the Framingham cohort, heritability of presbycusis phenotypes was estimated to be 0.35-0.55, based on evaluations of audiometric examinations in the Framingham cohort [35] . The study compared the auditory status in genetically unrelated (spouse pairs) and genetically related people (sibling pairs, parent-child pairs), revealing a clear familial aggregation for agerelated hearing levels. The effect of genes was found larger for the strial pattern of HL (flat audiogram) compared to the sensory phenotype (abrupt high-tone loss). Heritability index was high in pairings of women (sister-sister, 0.53; mother-daughter, 0.36). Because of the difficulty of studying an outbred and older human population that includes intrinsic and environmental variables accumulated over the course of a lifetime [36, 38] , most studies have identified ARHL genes in a laboratory setting using mouse models, in which rigorous genetic and experimental control can be achieved, such that age is the most significant factor in an animal model of ARHL."
        },
        {
            "section": "Heritability, allelism and genetic modifiers of presbycusis",
            "text": "In mice, age-related hearing loss (AHL) is genetically multifactorial, modulated by multiple quantitative trait loci (QTLs). AHL closely resembles sensorineural presbyscusis in humans with regard to pathology and aetiology. A major QTL for AHL (Ahl1 ) was identified on mouse chromosome 10, overlapping with the modifier of the deaf waddler locus (mdfw ) region. Several loci associated with hearing function map near the mdfw locus, including the mouse mutations waltzer and Jackson circler [39] . In humans, the Usher syndrome type 1D gene and the recessive non-syndromic deafness gene DFNB12 have been mapped to chromosome 10q21-q22, which is orthologous to the mdfw region in the mouse. The gene responsible for the dfw mutation has been identified as a plasma membrane ATPase type 2-Ca 2+ transporter pump (Atp2b2 ). In the cochlea, the Atp2b2 protein was localized to stereocilia and the basolateral wall of hair cells, implying that it may be essential for the removal of the Ca 2+ from subcellular domains of both auditory and vestibular hair cells [39] . Genetic fine mapping suggests that the mouse waltzer mutation within cadherin 23 (Cdh23 v ) is allelic with mdfw [40] . On the other hand, genetic complementation tests have shown allelism between ahl1 and mdfw, and both are found to add to the severity of HL caused by mutation of the Atp2b2 gene [41] . It was subsequently shown that the Ahl1 gene might also be allelic to Cdh23 v [42] . Thus, Cdh23 may be an important gene that may be involved not only in certain forms of congenital deafness but also in ARHL, and has the potential to genetically interact with other deafness genes to affect hearing. One synonymous single-nucleotide polymorphism (SNP) in Cdh23 (753G>A) was indeed found associated with AHL and the deafness modifier mdfw [42] . The Cdh23 753A variant causes in-frame skipping of exon 7. The peptide of 43 amino acids encoded by exon 7 is part of the third and fourth ectodomains, which constitutes a potential homodimerization site of the Cdh23 protein. Cdh23 753A is characterized as a pathological and hypomorphic allele and was present in at least 10 inbred mice strains, including the strain C57BL/6J, in a homozygous status. Homozygosity at Cdh23 753A significantly increases susceptibility for AHL, but is not the only determinant. Both the time of onset and the rate of progression of HL in Cdh23 753A homozygotes depend on the effects of strain-specific genetic factors [43] . A number of genes or loci have been identified as Cdh23 modifiers, including the mitochondrial mutation in the tRNA-Arg gene (mt-Tr 9827ins8 ) (as in A/J) [44] , ahl2 (as in NOD/LtJ) [45] ; and ahl3 [46] . A combination of either one of these 'accelerating alleles' with homozygosity for Cdh23 753A has been shown to exacerbate HL. Furthermore, studies of heterozygous deaf-waddler mice show that partial loss of Atp2b2 activity modifies, but is not itself sufficient to cause, HL, and haploinsufficiency at Atp2b2 and homozygosity of Cdh23 753A together, but neither alone, cause early-onset HL in mdfw mice (Atp2b2+/dfw-2J mdfw/mdfw). It has also been reported that heterozygosity for a null allele of Atp2b2 predisposes mice to noise-induced sensorineural hearing loss [47] . Reciprocally, in humans, a hypofunctional variant (V586M) in ATP2B2 has also been found associated with increased HL caused by a homozygous mutation in CDH23 in a manner analogous to the interaction between the dfw 2J allele of Atp2b2 and the ahl allele of Cdh23 in mice. Additionally, ATP2B2 V 586M has been found to modify the severity of HL due to a mutation in MYO6 and has been suggested to predispose to NIHL [48] ."
        },
        {
            "section": "Candidate genes for presbycusis",
            "text": "The cochlea, with its intricate structure and diverse cell types, requires a broad range of proteins with different functions, including maintenance of structural and mechano-electrical transduction integrity and neuronal innervation. The interaction of genes and proteins at different levels influences a multitude of HL parameters, including HL type, thresholds, frequency range and age of onset. To date, genes that underlie approximately 40 forms of non-syndromic hearing loss (NSHL), and even more for syndromic HL, are cloned. These genes belong to different gene families with various functions, including transcription factors, extracellular matrix molecules, cytoskeletal components, ions channels and transporters. Potentially, moderate functional variants in any of the numerous genes involved in cochlear function could have impact on an individual's risk of ARHL. All known monogenic HL genes are potential candidates for susceptibility to ARHL. Genes that protect against oxidative stress and mitochondrial genes can also be considered important candidates, since it is known that oxidative stress plays a substantial role in the development of ARHL."
        },
        {
            "section": "Oxidative stress",
            "text": "Free radicals and other reactive species are considered to be important causative factors in the development of diseases of ageing, including presbyscusis. The cochlea comprises metabolically active tissues producing reactive oxygen species (ROS). Concomitant with the increase in ROS is a reduced production or function of the endogenous enzymes that protect the cell from ROS damage. The loss of antioxidant defence appears to be involved in the ageing process. Two classes of antioxidant enzymes are active in the cochlea: enzymes involved in glutathione (GSH) metabolism (glutathione S-transferase, GST; glutathione peroxidase, GPX1; glutathione reductase, GSR) and enzymes involved in the breakdown of superoxide anions and hydrogen peroxide (eg catalase, CAT; Cu/Zn superoxide dismutase, SOD1) [49, 50] . Impaired function of antioxidant enzymes caused by genetic variation has been postulated as leading to failure of cellular responses against the toxic effects of ROS and subsequent peroxidative cell injury. Studies of knock-out models of Gpx1 and Sod1 have shown that deletion in the two antioxidant genes can lead to both age-related and noise-induced HL [51] [52] [53] . These mice show the phenotypic characteristics of ARHL. Glutathione-S-transferases (GST) are known to function in antioxidant pathways and in detoxification, and thus might play an important role in protection of the cochlea. GST consists of several gene classes, including GSTM and GSTT, coding for cytosolic enzymes [54, 55] . GSTM1 and GSTT1 genes show genetic variability in humans. Up to 50% of the Caucasian population are null genotypes for the GSTM1 gene [56] . These null genotypes cannot conjugate metabolites specific for these enzymes, rendering these individuals more prone to damage caused by oxidative stress and possibly more susceptible to ARHL. GSTM1-null individuals have been shown to have lower amplitudes of high frequency otoacoustic emissions compared to individuals possessing the gene, indicating that GSTM1-null individuals might be more prone to ARHL [57] . The enzyme of Nacetylation (NAT) is also known to be involved in mediation of xenobiotic toxicity. A number of epidemiological studies suggest that genetic variations in the NAT genes may confer susceptibility to oxidative stress and xenobiotic insult. The gene encoding the NAT 2 enzyme, which in human populations segregates into rapid, intermediate and slow 'acetylator' phenotypes, has recently been reported in association with presbycusis [58] ."
        },
        {
            "section": "Oxidative stress",
            "text": "Mitochondria, and especially mitochondrial DNA (mtDNA), are major targets of free radical attack. Specific deletions within mtDNA, also known as the common ageing deletions, accumulate with age in human and rodent tissues, including the cochleae. One specific mtDNA deletion, mtDNA4,834, has been linked to AHL in rodents [59] . The equivalent mutation, mtDNA4,977, deletion in human has also been identified, using archived temporal bones from patients with presbycusis [60] [61] [62] . Interestingly, consistent with a causal role for mtDNA mutations in ARHL, mice carrying a mutation in the exonuclease domain of the nucleus-encoded catalytic subunit of the mtDNA polymerase gamma (POLG), accumulated mtDNA mutations and displayed premature onset of ageingrelated phenotypes, including HL [63] ."
        },
        {
            "section": "Genes for monogenic forms of deafness",
            "text": "In its most typical form, ARHL is non-syndromic, bilaterally symmetrical, characterized by a progressive loss of auditory sensitivity that advances from high to low frequencies [64, 65] . Many late-onset forms of monogenic non-syndromic hearing loss (NSHL) show similar phenotypes, but their audiological phenotype is generally more severe compared with ARHL. Most late-onset NSHL loci only account for one or a few families, and so far none of the identified mutations is common. Their contribution to deafness on a population basis might therefore be limited, or is currently unknown. However, because of their similarities with ARHL, genes involved in late-onset NSHL are also excellent candidates for ARHL. Additionally, genes responsible for other forms of monogenic deafness might also play a role in ARHL, especially because mutations in the same gene can lead to different types of HL, including both early-and late-onset deafness, or to dominant and recessive, or syndromic and nonsyndromic, forms of deafness [66] ."
        },
        {
            "section": "Genetic strategy to find susceptibility genes for ARHL",
            "text": "Approaches to identifying susceptibility genes in complex polygenic and multifactorial diseases, such as ARHL, are generally based on one of two strategies."
        },
        {
            "section": "Genetic strategy to find susceptibility genes for ARHL",
            "text": "Reverse genetics attempts to identify the multiple genes by genome-wide linkage or association to genetic markers of variation. For complex disease, parametric linkage is considerably less powerful, due to uncertainty about the mode of inheritance and penetrance, and because an estimate of the frequency of the susceptibility allele cannot be reliably determined by segregation analysis. Additionally, many unaffected individuals may carry the susceptibility allele but not be affected by the disease. Adding to the complexity, the phenotypic effect of an individual susceptibility allele may be quite small. To circumvent these limitations, model-free non-parametric linkage analysis is used to estimate the extent of sharing of alleles identical by descent by sibling pairs at each polymorphic marker or, in multipoint analyses, of several adjacent markers. The association genome scan has also been employed as a means to detect genetic effects in complex diseases. In such cases, differences in population genetic parameters [allele, genotype frequency, Hardy-Weinberg equilibrium (HWE), haplotype disposition and linkage disequilibrium (LD)] between unrelated disease cases and controls become tools of gene mapping. Unlike linkage studies, disease-gene mapping by association is based on LD between the test marker and the disease gene. LD is a property of populations, and thus depends on the natural history of the disease gene containing a chromosome segment of the test population, and on the recombination distance between the disease gene and the test marker. LD mapping is generally performed using single nucleotide polymorphisms (SNPs), since these are more common than, and less mutable than, microsatellites [67] . In reverse genetics approaches, the genetic marker data are used to drive or refine the phenotypes, based on genetic marker data, that is, to define phenotypic groupings that are distinguished by higher rates of allele-sharing or distorsion of genetic equilibria."
        },
        {
            "section": "Genetic strategy to find susceptibility genes for ARHL",
            "text": "Forward genetics methods are essentially phenotype-driven, moving from phenotype to gene; a gene is known to exist only because a mutation has resulted in an altered phenotype. Under this unidirectional approach, the putative causal variants can be identified in candidate genes, selected on the basis of information regarding the biochemical pathways/or biological function, and then studied to determine whether they do increase susceptibility to disease on a population basis, using association studies. These approaches are largely complementary, although they are often applied by independent research groups."
        },
        {
            "section": "Genetic strategy to find susceptibility genes for ARHL",
            "text": "To date, genetic analysis of ARHL has been limited. However, with the recent major advances in hearing research, the human genome sequence completed, a comprehensive map of human genetic variation (HapMap) available, together with a growing awareness of the importance of healthy ageing as global populations begin to age, a search for susceptibility alleles for ARHL can be justifiably undertaken. Two types of study design can be used to identify the genetic determinants of ARHL."
        },
        {
            "section": "Association studies",
            "text": "The most common type of variation in the human genome is the SNP. It is estimated that SNPs occur about once every 1000 base pairs in the genome and these common polymorphisms are the source of variation among individuals. A popular hypothesis about allelic architecture proposes that most of the genetic risk for common, complex diseases is due to disease loci where there is one common variant (or a small number of them) [68] . The 'common disease-common variant' (CDCV) hypothesis implies that association mapping should be a powerful tool for detecting complex disease loci of small effect, and provides an important impetus for the Haplotype Map Project, and the proposed genome-wide association scans for genetic studies of complex human diseases [69] . In the long term, these will lead to the identification of new QTLs for ARHL once large suitable cohorts have been assembled and characterized, and will undoubtedly allow the finding of susceptible genes for ARHL that we have no current biological basis for implication in the pathogenesis of ARHL. So far, only a few association studies on candidate genes have been performed in ARHL, using both standard case-control association analysis and quantitative analysis. Van Laer et al [70] reported two independent association studies, using two non-synomous SNPs within the DFNA5 gene, to investigate its possible involvement in ARHL, but no allelic or genotypic association was detected. In another study, Fransen et al [71] define a quantitative trait (QT) value, correcting for age and gender, to allow the genetic study of ARHL as a QT. No association was found; however, this approach may improve the power to detect genes with small to medium effects and circumvents the difficulty of assigning case and control status to what is a continuous trait. Recently, Unal et al [58] reported an association between ARHL and a N-acetyl transferase polymorphism in a group comprising 68 ARHL cases and 98 controls. However, this will require replication in larger samples for validation."
        },
        {
            "section": "Linkage studies",
            "text": "Linkage analysis and positional cloning have been successful over the last decade for identification of monogenic forms of deafness genes. There are several limitations to applying this Mendelian-type strategy to clone genes for common, complex diseases such as ARHL. The gene mutations in Mendelian disorders are those with large effect and strong genotype-phenotype correlations, whereas the genetic determinants of the complex diseases are susceptibility alleles, rather than disease alleles. That is, there are individuals who carry the susceptibility allele but are unaffected, either because they lack another allele (or alleles) that is necessary for disease expression (ie a gene-gene interaction) or because of a lack of exposure to environmental factors necessary for disease expression (ie a gene-environment interaction). To circumvent these limitations, the linkage analysis in complex diseases is often based on the sharing of alleles identical by descent at a marker locus or loci by affected relatives, rather than a few large kindreds. In many lateonset diseases, this is also necessary because collection of DNA samples from parents of affected individuals is far more difficult. Once the putative linkage is replicated, fine mapping is undertaken to narrow the genomic region harbouring the putative susceptibility allele. In complex diseases, analysis of recombination events is not useful, due to unaffected carriers of the susceptibility allele. Fine mapping is therefore performed using linkage LD, or association testing, between genetic markers and disease. This should narrow a broad region of linkage (∼10-40 cM) to a physically small region of association (∼1 000 000 base pairs) for intensive and thorough analysis. To date, three linkage analyses of ARHL have been published [70, 72, 73] . In the first two of these reports, a pedigree-based approach was applied on a retrospective audiological investigation in the Framingham Heart Study cohort. During 1973-1975 audiometric data and blood samples were collected from members of the original cohort, and during 1995-1999 sample collection from the offspring generation was conducted and extended pedigrees among the Framingham participants were constructed. DNA and audiometric data from 1789 subjects from 328 pedigrees were available for analysis. In the first study, as DFNA5 was considered an excellent candidate ARHI susceptibility gene, Van Laer et al [70] performed linkage analysis to a quantitative measure of high-frequency HL on Framingham participants to determine whether DFNA5 contributed to the ARHL phenotype. No significant linkage between ARHL and microsatellite markers from the DFNA5 region could be found. The second genome-wide scan aimed to identify chromosomal loci that predispose individuals to ARHL [72] . The scan identified several locations that show suggestive evidence of linkage with ARHL, including 11p, 11q13.5, 11q25, 14q, regions of the genome known to contain the deafness genes Usher 1C, Myosin 7A, and the loci linked to DFNB20 and Usher 1A, respectively. There was no linkage to the murine ahl locus, located on mouse chromosome 10, syntenic to human chromosome 10q21-q22. This study focused on lowand medium-frequency HL rather than high-frequency HL, which may be the most common form of ARHL. Lastly, in a recent linkage study by sibling-pair methods, using the NAS-NRC Twin Panel of US veterans (born 1917-1927), Garringer et al [73] reported a region of linkage with ARHL on chromosome 3q, overlapping with the DFNA18 locus. There was no evidence of linkage for any of the four chromosomal regions reported by DeStefano et al [72] in the Framingham study. However, the sample size consisted of only 50 pairs of elderly fraternal twins and the study included only male subjects. In addition, it relied on self-reporting of HL by the participants without any confirmation from a medical professional or audiometric testing. For ARHL, as for other complex diseases, irreproducibility of positive findings has been a common problem in investigating the genetic basis of the disorders. Several reasons are cited, including small sample size, a lack of statistical power for detection of small and moderate effects, and differences in study designs."
        },
        {
            "section": "Conclusions",
            "text": "ARHL is a complex disorder, influenced by genetic, environmental/lifestyle and stochastic factors. Despite its high prevalence and the recent progress in hearing research, few attempts to identify genetic determinants of ARHL have been made. In this postgenome era, with high-throughput genotyping platforms now developed, a HapMap project to guide marker selection, the constructive challenge we face is to find strategies that are best suited to unravel the genetic basis of complex traits such as presbyscusis. The reverse genetics approach, where phenotypes are refined in relation to genetic marker data (linkage and linkage-disequilibrium analysis), although statistical challenges remain, may lead to the identification of susceptibility components for ARHL. On the other hand, forward genetics may also be a promising approach. Isolating all the genes in the human genome, as well as identifying and cataloguing the functional variants within them in the human population, will allow assessment of the impact of genotype on phenotypic outcome of interest. Additionally, complementary strategies, based on functional genomics technology involving microarrays and proteomics, can be used to develop predictors of disease susceptibility based on biological pathways physiologically relevant to ARHL. Nevertheless, choices in study designs will still be the major factor in the probability of success. Determination of the genetic variants involved in ARHL should provide new insights into the disorder mechanism, which may uncover new leads for pharmaceutical intervention and could result in the development of screening kits to identify individuals at increased risk."
        },
        {
            "section": "",
            "text": ", 2007, 2, Downloaded from https://pathsocjournals.onlinelibrary.wiley.com/doi/10.1002/path.2102, Wiley Online Library on [24/03/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License"
        },
        {
            "section": "",
            "text": ", 2007, 2, Downloaded from https://pathsocjournals.onlinelibrary.wiley.com/doi/10.1002/path.2102, Wiley Online Library on [24/03/2023]. See the Terms and Conditions (https://onlinelibrary.wiley.com/terms-and-conditions) on Wiley Online Library for rules of use; OA articles are governed by the applicable Creative Commons License"
        }
    ]
}